# Activity 1

In [1]:
import pandas as pd
import numpy as np

<b> 1. Use pandas to load the Titanic dataset and use the head function on the dataset to display the top rows of the dataset. Describe the summary data for all columns. </b>

In [2]:
titanic = pd.read_csv('titanic.csv')
titanic.head()

,Unnamed: 0,Cabin,Embarked,Fare,Pclass,Ticket,Age,Name,Parch,Sex,SibSp,Survived
0,0,NaN,S,7.2500,3,A/5 21171,22.0,"Braund, Mr. Owen Harris",0,male,1,0.0
1,1,C85,C,71.2833,1,PC 17599,38.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,female,1,1.0
2,2,NaN,S,7.9250,3,STON/O2. 3101282,26.0,"Heikkinen, Miss. Laina",0,female,0,1.0
3,3,C123,S,53.1000,1,113803,35.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,female,1,1.0
4,4,NaN,S,8.0500,3,373450,35.0,"Allen, Mr. William Henry",0,male,0,0.0

<b> 2. We don't need the Unnamed: 0 column. In Exercise 1.03: Advanced Indexing and Selection, we demonstrated how to remove the column using the del command. How else could we remove this column? Remove this column without using del. </b>

In [3]:
titanic.drop('Unnamed: 0', inplace=True, axis=1)
titanic.head()

,Cabin,Embarked,Fare,Pclass,Ticket,Age,Name,Parch,Sex,SibSp,Survived
0,NaN,S,7.2500,3,A/5 21171,22.0,"Braund, Mr. Owen Harris",0,male,1,0.0
1,C85,C,71.2833,1,PC 17599,38.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,female,1,1.0
2,NaN,S,7.9250,3,STON/O2. 3101282,26.0,"Heikkinen, Miss. Laina",0,female,0,1.0
3,C123,S,53.1000,1,113803,35.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,female,1,1.0
4,NaN,S,8.0500,3,373450,35.0,"Allen, Mr. William Henry",0,male,0,0.0

<b> 3. Compute the mean, standard deviation, minimum, and maximum values for the columns of the DataFrame without using describe. Note that you can find the minimum and maximum values using the df.min() and df.max() functions. </b>

In [4]:
titanic.mean()

Fare        33.295479
Pclass       2.294882
Age         29.881138
Parch        0.385027
SibSp        0.498854
Survived     0.383838
dtype: float64

In [5]:
titanic.std()

Fare        51.758668
Pclass       0.837836
Age         14.413493
Parch        0.865560
SibSp        1.041658
Survived     0.486592
dtype: float64

In [6]:
titanic.min()

Fare                          0
Pclass                        1
Ticket                   110152
Age                        0.17
Name        Abbing, Mr. Anthony
Parch                         0
Sex                      female
SibSp                         0
Survived                      0
dtype: object

In [7]:
titanic.max()

Fare                            512.329
Pclass                                3
Ticket                        WE/P 5735
Age                                  80
Name        van Melkebeke, Mr. Philemon
Parch                                 9
Sex                                male
SibSp                                 8
Survived                              1
dtype: object

<b> 4. Use the quantile method to get values for the 33, 66, and 99% quantiles. </b>

In [8]:
titanic.quantile(0.3366)

Fare         8.6625
Pclass       2.0000
Age         23.0000
Parch        0.0000
SibSp        0.0000
Survived     0.0000
Name: 0.3366, dtype: float64

In [9]:
titanic.quantile(0.99)

Fare        262.375
Pclass        3.000
Age          65.000
Parch         4.000
SibSp         5.000
Survived      1.000
Name: 0.99, dtype: float64

<b> 5. Find how many passengers were from each class using the groupby method. </b>

In [10]:
for pclass, passengers in titanic.groupby('Pclass'):
    print(f'In the class {pclass} there are {len(passengers)} passengers')

In the class 1 there are 323 passengers
In the class 2 there are 277 passengers
In the class 3 there are 709 passengers

<b> 6. Find how many passengers were from each class answer by using selecting/indexing methods to count the members of each class. You can use the unique() method to find out the unique values of each class. Confirm that the answers to Step 6 and Step 7 match </b>

In [11]:
print(f'In the class 1 there are {len(titanic[titanic.Pclass == 1])} passengers')
print(f'In the class 1 there are {len(titanic[titanic.Pclass == 2])} passengers')
print(f'In the class 1 there are {len(titanic[titanic.Pclass == 3])} passengers')

In the class 1 there are 323 passengers
In the class 1 there are 277 passengers
In the class 1 there are 709 passengers

<b> 7. Determine who the eldest passenger in third class was. </b>

In [12]:
max_Age = titanic[titanic.Pclass == 3].Age.max()

In [13]:
titanic.loc[titanic.Age == max_Age]

,Cabin,Embarked,Fare,Pclass,Ticket,Age,Name,Parch,Sex,SibSp,Survived
851,NaN,S,7.775,3,347060,74.0,"Svensson, Mr. Johan",0,male,0,0.0

<b> 8. For a number of machine learning problems, it is very common to scale the numerical values between 0 and 1. Use the agg method with Lambda functions to scale the Fare and Age columns between 0 and 1.</b>

In [14]:
titanic.agg({
    'Fare': lambda x: x / max(x),
    'Age': lambda x: x / max(x)
})

          Fare      Age
0     0.014151  0.27500
1     0.139136  0.47500
2     0.015469  0.32500
3     0.103644  0.43750
4     0.015713  0.43750
...        ...      ...
1304  0.015713      NaN
1305  0.212559  0.48750
1306  0.014151  0.48125
1307  0.015713      NaN
1308  0.043640      NaN

[1309 rows x 2 columns]

<b> 9. Replace the NaN value of this row in the main DataFrame with the mean Fare value for those corresponding to the same class and Embarked location using the groupby method.  </b>

the one individual entry in the dataset without a listed Fare value

In [15]:
titanic_nan_fare = titanic.loc[(titanic.Fare.isna())]
titanic_nan_fare

,Cabin,Embarked,Fare,Pclass,Ticket,Age,Name,Parch,Sex,SibSp,Survived
1043,NaN,S,NaN,3,3701,60.5,"Storey, Mr. Thomas",0,male,0,NaN

In [16]:
embarked_class_groups = titanic.groupby(['Embarked', 'Pclass'])
indices = embarked_class_groups.groups[(titanic_nan_fare.Embarked.values[0], titanic_nan_fare.Pclass.values[0])]

In [17]:
mean_fare = titanic.iloc[indices].Fare.mean()

In [18]:
titanic.loc[(titanic.index == 1043), 'Fare'] = mean_fare
titanic.iloc[1043]

Cabin                      NaN
Embarked                     S
Fare                   14.4354
Pclass                       3
Ticket                    3701
Age                       60.5
Name        Storey, Mr. Thomas
Parch                        0
Sex                       male
SibSp                        0
Survived                   NaN
Name: 1043, dtype: object